Repository: OmegaT-L10N/mfe
Catalog: omegat/project_save.tmx
Source language: en
Languages: mfe

source: "This is a source term, which contains a comma","c'est un terme, qui contient une virgule"
mfe: "This is a source term, which contains a comma","Ala enn term sours, ki ena enn virgil"

source: ... matches the following
mfe: ... koresponn seki isi

source: ...but the same characters are displayed properly in the Editing pane: the extension and the file encoding do not match.
mfe: ...me mem karakter afise dans pano Editer: lextension ek lenkodaz file-la pas koresponn.

source: ...matches the following
mfe: ... koresponn seki isi

source: OmegaT automatically detects glossary files in this folder when a project is opened.
mfe: OmegaT pou detek otomatikman bann file gloser dan sa folder-la letan enn proze ouver.

source: Note: Of course there are other ways and means to create a simple file with tab delimited entries.
mfe: Pran not: Biensir ena lezot fason ek mwayin pou kre enn sinp file avek lantre delimite par tabilasion.

source: Microsoft Terminology Collection can be downloaded in nearly 100 languages and can serve as a cornerstone IT glossary.
mfe: Kapav download Microsoft Terminology Collection dan preske 100 langaz. Li kapav servi kouma enn fondman pou enn gloser informatik.

source: A character in the Greek block (simple block)
mfe: Enn karakter dan blok Grek (sinp blok)

source: A currency symbol
mfe: Enn sinbol lamone

source: A dialog opens, allowing you to enter the source term, target term and any comments you may have:
mfe: Enn bwat dialog pou ouver ki pou permet ou azout term sours, term sib ek ninport ki komanter ki ou le.

source: A digit: [0-9]
mfe: Enn nimero: [0-9]

source: A nice collection of useful regex cases can be found in OmegaT itself (see Options > Segmentation).
mfe: OmegaT mem ena enn bon koleksion lexpresion regilie deza (get Opsion > Segmantasion).

source: A non-digit: [^0-9]
mfe: Enn karakter ki pa enn nimero: [^0-9]

source: A non-whitespace character: [^\s]
mfe: Enn karakter ki pa enn karakter lespasman: [^\s]

source: A non-word boundary
mfe: Pa enn lextremite enne mo

source: A non-word character: [^\w]
mfe: Enn karakter ki pa enn karakter enn mo: [^\w]

source: A number of interactive tools are available to develop and test regular expressions.
mfe: Ena bokou zouti interaktif ki permet devlop ek teste lexpresion regilie.

# A whitespace character: [ x0Bf]
source: A whitespace character: [ \t\n\x0B\f\r]
mfe: Enn karakter lespasman: lespas, tabilasion, retour lalign [ \t\n\x0B\f\r]

source: A word boundary
mfe: Lextremite enn mo

source: A word character: [a-zA-Z_0-9]
mfe: Enn karakter enn mo: [a-zA-Z_0-9]

source: Also supported is the CSV format.
mfe: Format CSV osi aksepte.

source: An uppercase letter (simple category)
mfe: Enn let maziskil (sinp kategori)

source: Any character (except for line terminators)
mfe: Ninport ki karakter (exsepte terminezon lalign)

source: Any character except a, b, or c (negation)
mfe: Ninport ki karakter exsepte a, b, ou c (negasion)

source: Any character except one in the Greek block (negation)
mfe: Ninport ki karakter exsepte karakter blok Grek (negasion)

source: Any letter except an uppercase letter (subtraction)
mfe: Ninport ki let exsepte let maziskil (soustraksion)

source: As entries can mix words from priority and non priority glossaries, the words from the priority glossary are displayed in bold.
mfe: Etan done ki enn lantre kapav mix gloser prioriter ek non prioriter, bann mo gloser prioriter afise an gra.

source: As the existing content will not be touched, damage to an existing file would be limited.
mfe: Etan done ki konteni existan pa pou modifie, pa pou ena erer dan file existan.

source: Check in Ctrl E Project Properties .
mfe: Get dan Ctrl E Proze Propriete .

source: Check that your dict files are in the correct folder (or in a subfolder below it).
mfe: Chek si ou file dict dan bon folder (ouswa dan enn subfolder sa folder la).

source: Comment fields are separated by a comma ','.
mfe: Bann komanter separe par enn virgil ','.

source: Common glossary problems
mfe: Problem gloser ki kouran

source: Dictionaries
mfe: Diksioner

source: Dictionaries in OmegaT are based on the StarDict or on the Lingvo DSL format.
mfe: Diksioner dan OmegaT baze lor format StarDict ouswa Lingvo DSL.

source: Does the folder contain three files of the same name, with extensions?
mfe: Eski folder la ena trwa file mem nom, avek lextansion?

source: Download the file - it should be a tarball archive (extension tar.bz or tar.bz2).
mfe: Download file la – li pou enn arsiv tarball (lextansion tar.bz ouswa tar.bz2).

source: Either X or Y
mfe: Ouswa X ouswa Y

source: Enables case-insensitive matching (by default, the pattern is case-sensitive).
mfe: Permet ou fer bann resers san respekt maziskil (par defo, resers respekt maziskil).

source: English: the same check as above, but concerning consonants ("a", not "an")
mfe: Angle: mem verifikasion ki laho, me pou konsonn ("a", not "an")

source: English: words, beginning with vowels, should generally be preceded by "an", not "a"
mfe: Angle: bann mo ki koumans par vwayel mars normalman ek "an", pa "a"

source: File format
mfe: Format file

source: Finds the following:
mfe: Trouv bann rezilta swivan:

source: For example, a+ will match the aaa in aaabbb
mfe: Par exanp, a+ pou match aaa dan aaabbb

source: For example, a+? will match the first a in aaabbb
mfe: Par exanp, a+? pou match premie a dan aaabbb

source: For example, this is the backslash character
mfe: Par exanp, sa karakter-la backslash

source: Glossaries
mfe: Gloser

source: Glossaries are files created and updated manually for use in OmegaT.
mfe: Enn gloser, li enn file ki finn kree ek aktialize manielman pou itilizasion dan OmegaT.

source: Glossary files are simple plain text files containing three-column, tab-delimited lists with the source and target terms in the first and second columns respectively.
mfe: Bann file gloser, zot bann sinp file text avek trwa kolonn ki form trwa lalis delimite par tabilasion avek term sours ek term sib dan premie ek deziem kolonn respektivman.

source: Glossary pane
mfe: Pano Gloser

source: Highlighting it in the Glossary pane and then rightclicking insets at the cursor position in the target segment.
mfe: Highlight sa mo-la dan pano Gloser ek fer enn click drwa lor li apre ki ou finn met cursor dan bon pozission dan segman sib.

source: How to create glossaries
mfe: Kouma kree bann gloser

source: How to download and install dictionaries
mfe: Kouma download ek instal diksioner

source: If an OmegaT project contains one or more glossaries, any terms in the glossary which are also found in the current segment will be automatically displayed in the Glossary viewer.
mfe: Si enn proze OmegaT ena enn (ouswa plizier) gloser, tou bann term gloser-la ki dan segman an kour afise otomatikman dan pano Gloser.

source: If it is tar.bz, you have forgotten to unpack (untar) it.
mfe: Si li tar.bz, ou finn blie dekonpres (desarsiv) li.

source: If only one file is present, check its extension.
mfe: Si ena enn sel file, get so lextansion.

source: If the file already exists, no attempt is done to verify the format or the character set of the file: the new entries will always be in tab-separated format and UTF-8.
mfe: Si file-la deza existe, pa pou ena verifikasion so format ou so set karakter: bann nouvo lantre pou touzour format text separe par tabilasion ek UTF-8.

source: If you have an existing terminology handling system it is quite possible it offers the export of terminology data via TBX format.
mfe: Si ou ena enn sistem zestion termilozik, li posib ki li propoz exportasion data terminolozik via format TBX.

source: In addition to the plain text format, TBX format is also supported as a read-only glossary format.
mfe: An plis format text brit, format TBX osi aksepte antan ki format gloser read-only.

source: Merriam Webster dictionary - use
mfe: Itilisation diksioner Merriam Webster

source: New terms can be added manually to the glossary file(s) during translation, for example in a text editor.
mfe: Kapav manielman azout enn nouvo term dan file gloser pandan tradiksion, ex. dan enn editer text.

source: Newly added terms will not be recognized once the changes in the text file have been saved.
mfe: Bann term ki finn fek azoute pa pou rekonet tan ki bann sanzman file text-la pa enrezistre.

source: No glossary file found in the "glossary" folder.
mfe: Pena oken file gloser dans folder "glossary".

source: Note that in addition to "source-target" dictionaries you can, using the Dictionary feature, obtain access to information such as:
mfe: Pran kont ki an plis bann diksioner "sours-sib", kapav, si itiliz fonksion Diksioner, aksed lezot linformasion kouma:

source: Note that in the above case, this is just half (or even less) of the story, as the target language (Slovenian) uses declension.
mfe: Pran kont ki dan sa lexanp-la, Note that in the above case, this is just half (or even less) of the story, as the target language (Slovenian) uses declension.

source: Note: the .tbx output of MultiTerm seems to not be reliable (November 2013), it is better to use the .tab output of MultiTerm instead.
mfe: Atension: output .tbx MultiTerm koumandir pa fiab (Novam 2013). Mie vo itiliz output .tab MultiTerm.

source: Nothing speaks against using Notepad++ on Windows, GEdit on Linux for instance or some spreadsheet program for this purpose: any application, that can handle UTF-8 (or UTF-16 LE) and that can show white space (so that you do not miss the required TAB characters) can be used.
mfe: Personn pa anpes ou itiliz par exanp Notepad++ dan Windows, GEdit dan Linux ouswa enn program spreadsheet pou kree enn gloser: ou kapav itiliz ninport ki aplikasion ki kapav pran an sarz UTF-8 (ouswa UTF-16 LE) ek afis bann karakter lespasman (pou kapav itiliz karater TAB ki obligatwar).

source: Nothing, but ends quoting started by \Q
mfe: Nanyen, me li fini sitasion koumanse par \Q

source: Nothing, but quotes all characters until \E
mfe: Nanyen, me li sit tou bann karakter ziska \E

source: Nothing, but quotes the following character.
mfe: Nanyen, me li sit karakter swivan.

source: Of course, the encoding must be compatible with both the languages contained, so Unicode is recommended.
mfe: Parski lankodaz-la bizin konpatib ant toule de lang inplike, Unicode rekomande.

source: One or more of the above problems may have been fixed, but the project has not been reloaded.
mfe: Enn ouswa plizier problem mansione laho finn resoud, me proze-la pa finn reload.

source: Period, followed by an upper-case letter - possibly a space is missing between the period and the start of a new sentence?
mfe: Pwin, swivi par enn maziskil − li posib ki enn lespas manke ant enn pwin ek enn nouvo fraz.

source: Priority glossary
mfe: Gloser prioriter

source: Problem: In the glossary pane, some characters are not displayed properly
mfe: Problem: Dans pano gloser, detrwa karakter pas bien afise

source: Problem: No glossary terms are displayed - possible causes:
mfe: Problem: Pena okenn term gloser ki afise. Posibilite:

source: Problems with dictionaries
mfe: Problem avek diksioner

source: Regex - Boundary matchers
mfe: Regex − Spesifikater limit

source: Regex - Character
mfe: Regex − Karakter

source: Regex - Character classes
mfe: Regex − Klas karakter

source: Regex - Classes for Unicode blocks and categories
mfe: Regex − Klas pou kategori ek blok Unicode

source: Regex - Examples of regular expressions in translations
mfe: Regex − Exanp lexpresion regilie dan tradiksion

source: Regex - Flags
mfe: Regex − Marker

source: Regex - Greedy quantifiers
mfe: Regex − Kantifikater gourman

source: Regex - Logical operators
mfe: Regex − Operater lozik

source: Regex - Predefined character classes
mfe: Regex − Klas karakter predefini

source: Regex - Quotation
mfe: Regex − Kotasion

source: Regex - Reluctant (non-greedy) quantifiers
mfe: Regex − Kantifikater pares (non-gourman)

source: Regex tools and examples of use
mfe: Zouti regex ek exanp litilizasion

source: Regular expression
mfe: Lexpresion regilie

source: Regular expressions
mfe: Lexpresion regilie

source: Right-click in the glossary pane or press Ctrl+Shift+G to add a new entry.
mfe: Right-click dan pano gloser ouswa fer Ctrl+Shift+G pou azout enn nouvo lantre.

source: Search for the required language combination - for instance on the dictionary links given by the OmegaT Wiki.
mfe: Sers konbinezon lang ki bizin – get par exanp bann lien diksioner ki ena lor Wiki OmegaT

source: See The Regex Coach for Windows,Linux, FreeBSD versions of a stand-alone tool.
mfe: Get The Regex Coach pou enn zouti otonom ki fonksionn dan Windows, Linux ek FreeBSD.

source: See additional references and examples below.
mfe: Get plis referans ek lexanp enba.

source: Should you need more specific information, consult the Java Regex documentation.
mfe: Si ou bizin linformasion spesifik, get dokimantasion Java Regex.

source: Some of the dictionaries have no strings attached - i.e. are "Free to use", and others, like the selection above, are under the GPL license.
mfe: Sertin diksioner aksesib san kondision (setadir zot ‘lib’) alors ki lezot (kouma seleksion lao la) soumi lisans GPL/GNU.

source: Strings can be enclosed by quotes ", which allows having a comma inside a string:
mfe: Bann lasen karakter kapav koumans ek fini par apostrof ", seki vedir kapav met virgil dan linteryer lasen karakter:

source: TBX - Term Base eXchange - is the open, XML-based standard for exchanging structured terminological data, TBX has been approved as an international standard by LISA and ISO.
mfe: TBX – Term Base eXchange – li enn standard lib, baze lor XML, ki itilize pou esanz data terminolozik striktire. TBX finn aprouve antan ki norm internasional par LISA ek ISO.

source: Terms in the current segment which OmegaT finds in the glossary file(s) are displayed in the Glossary pane:
mfe: Segman en kour so bann term ki OmegaT trouve dan file gloser-la pou afise dan pano Gloser:

source: The alert (bell) character ('\u0007')
mfe: Karakter alert (signal) ('\u0007')

source: The beginning of a line
mfe: Koumansman enn lalign

source: The carriage-return character ('\u000D')
mfe: Karakter retour-sario ('\u000D')

source: The character with hexadecimal value 0xhh
mfe: Karakter avek valer hexadecimal 0xhh

source: The character with hexadecimal value 0xhhhh
mfe: Karakter avek valer hexadecimal 0xhhhh

source: The character with octal value 0mnn (0 <= m <= 3, 0 <= n <= 7)
mfe: Karakter ki ena valer oktal 0mnn (0 <= m <= 3, 0 <= n <= 7)

source: The character with octal value 0n (0 <= n <= 7)
mfe: Karakter ki ena valer oktal 0n (0 <= n <= 7)

source: The character with octal value 0nn (0 <= n <= 7)
mfe: Karakter ki ena valer oktal 0nn (0 <= n <= 7)

source: The character x, except the following...
mfe: Karakter x, exsepte pou seki suiv...

source: The construct
mfe: Konstriksion

source: The contents of glossary files are kept in memory and are loaded when the project is opened or reloaded.
mfe: File gloser so konteni garde dan memwar ek sarze kan ouver ouswa resarz proze.

source: The contents of the glossary pane will be updated accordingly.
mfe: Konteni pano gloser-la pou aktialize en fonksion.

source: The control character corresponding to x
mfe: Karakter control ki koresponn avek x

source: The encoding of glossaries is determined automatically.
mfe: Lankodaz bann gloser determine otomatikman.

source: The end of a line
mfe: Lafin enn lalign

source: The escape character ('\u001B')
mfe: Karakter escape ('\u001B')

source: The extension must be .txt or .utf8 (if not, it will be added).
mfe: So lextansion bizin .txt ouswa .utf8 (sinon li pou insere otomatikman).

source: The file does not need to exist when setting it, it will be created (if necessary) when adding a glossary entry.
mfe: File-la pa bizin existe letan konfigirasion, li pou kree (si neseser) kan azoute premie lantre dan gloser.

source: The following example shows Merriam Webster 10th dictionary "in action":
mfe: Sa lexanp-la montre diksioner Merriam Webster 10th ‘an aksion’:

source: The following list includes expressions you may find useful when searching through the translation memory:
mfe: Bann lexpresion dan lalis swivan kapav itil si ou fer enn resers dans memwar tradiksion:

source: The form-feed character ('\u000C')
mfe: Karakter lot paz ('\u000C')

source: The glossary file does not have the correct encoding.
mfe: File gloser pena enn ankodaz korek.

source: The glossary file does not have the correct extension (.tab, .utf8 or .txt).
mfe: File gloser pena bon lextension (.tab, .utf8 ouswa .txt).

source: The glossary file is empty.
mfe: File gloser vid.

source: The glossary function only finds exact matches with the glossary entry (e.g. does not find inflected forms etc.).
mfe: Fonksion gloser trouv zis bann mo ki koresponn exacteman avek bann lantre gloser (ex. li pa rekonet bann form konzige).

source: The items are not separated with a TAB character.
mfe: Bann eleman pa separe par karakter TAB.

source: The location of the .tbx file must be within the /glossary folder, but it can be in a deeper folder (e.g., glossary/sub/MyGlossary.tbx).
mfe: File .tbx la bizin dan folder /glossary, me li kapav dan enn subfolder (ex.: glossary/sub/MyGlossary.tbx).

source: The location of the file must be within the /glossary folder, but it can be in a deeper folder (e.g., glossary/sub/glossary.txt).
mfe: File-la bizin dan folder /glossary, me il kapav dan enn subfolder (ex.: glossary/sub/glossary.txt).

source: The location of the writable glossary file can be set in the Project > Properties ... dialog.
mfe: Kapav sanz lanplasman file gloser modifiab-la dan dialog Proze > Propriete... .

source: The newline (line feed) character ('\u000A')
mfe: Karakter pou nouvo lalign ('\u000A')

source: The project setting allows one to enter a name for a writable glossary file (see beginning of this chapter).
mfe: Ou kapav done enn nom file gloser ki modifiab dan paramet proze (get depi koumansman sa sapit-la).

source: The recognized extensions are TXT and UTF8
mfe: Lextansion ki program-la rekonet se TXT avek UTF8

source: The regular expressions (or regex for short) used in searches and segmentation rules are those supported by Java.
mfe: Lexpresion regilie (ou regex) itilize dan resers ek reg segmantasion li bann lexpresion itilize par Java.

source: The results from the priority glossary (by default, glossary/glossary.txt) appear in first places in the Glossary pane and in TransTips.
mfe: Rezilta gloser prioriter (glossary/glossary.txt) aparet an premie dan pano Gloser ek dans TransTips.

source: The source term does not have to be a single-word item, as the next example shows:
mfe: Term sours-la pa neseserman enn sel mo, kouma dan sa lexanp-la:

source: The tab character ('\u0009')
mfe: Karakter tab ('\u0009')

source: The third column can be used for additional information.
mfe: Trwaziem kolonn-la li kapav itilize pou lezot linformasion.

source: The underlined item "pop-up menu" can be found in the glossary pane as "pojavni menu".
mfe: Kapav trouv item souligne "pop-up menu" dan pano Gloser kouma "pojavni menu".

source: The vocabulary entry can have a comment added.
mfe: Lantre vokabiler kapav ena enn ouswa plizier komanter.

source: The word before the = sign is the source term, and its translation is (or are) the words after =.
mfe: Bann mo avan sign =, zot bann term sours. Bann mo apre sign =, zot bann tradiksion.

source: There are no terms in the current segment which match any terms in the glossary.
mfe: Okenn term dan segman an kour match enn term dan gloser.

source: There is no EXACT match between the glossary entry and the source text in your document - for instance plurals.
mfe: Pena enn EXACT match ant lantre gloser ek text sours dan ou dokiman (par exanp, diferans singilie/pliryel).

source: There should be three files, with extensions dz, idx and ifo.
mfe: Pou ena trwa file avek lextansion dz, idx ek ifo.

source: They generally follow much the same pattern (for an example from the Regular Expression Tester see below): the regular expression (top entry) analyzes the search text (Text box in the middle) , yielding the hits, shown in the result Text box.
mfe: Zot tou normalman parey (get enba pou enn lexanp Regular Expression Tester): lexpresion regilie (lantre laho) analiz text resers (bwat text omilie), met tou korespondans ki li finn trouve ensam ek afis zot dans bwat text resilta.

source: This chapter is intended for advanced users, who need to define their own variants of segmentation rules or devise more complex and powerful key search items.
mfe: Sa sapit-la li pou bann itilizater avanse, ki bizin definir zot prop reg segmantasion ouswa fer bann resers pli konplex ek avanse.

source: This format is the same as the tab separated one: source term, target term.
mfe: Format-la li parey kouma separasion par tabilasion: term sours, term sib.

source: This is much the same as the above example.
mfe: Li preske parey lexanp laho la.

source: This is required if you would like to enter any of the meta characters !$()*+.<>?[\]^{|} to match as themselves.
mfe: Li neseser si ou bizin servi enn meta karakter swivan !$()*+.<>?[\]^{|} pou ki li match limem.

source: To install the necessary files for the StarDict format, proceed as follows:
mfe: Pou instal bann file StarDict neseser, bizin:

source: To use an existing glossary, simply place it in the /glossary folder after creating the project.
mfe: Pou itiliz enn gloser, met li sinpleman dan folder /glossary apre kreasion proze.

source: Updating a glossary file is thus rather simple: press Ctrl+Shift+G and enter the new term, its translation and any comments you may have (ensuring you press tab between the fields) and save the file.
mfe: Savedir li bien sinp aktializ enn file gloser: apiy lor Ctrl+Shift+G ek ekrir nouvo term-la, so tradiksion ek ninport ki komanter ki ou le (fer atension met enn tab ant sak lantre) ek save file-la.

source: Usage
mfe: Itilizasion

source: Use untar utility (or its equivalent, for instance winrar in Windows) to extract its contents into the project folder "Dictionary".
mfe: Itiliz itiliter desarsivaz ‘untar’ (ouswa enn lekivalan, par exanp winrar dan Windows) pou ekstrer file-la so konteni dan folder "Dictionary" proze-la.

source: X followed by Y
mfe: Y apre X

source: X, once or not at all
mfe: X, enn sel fwa ouswa nanyen

source: X, one or more times
mfe: X, enn fwa ou plis

source: X, zero or more times
mfe: X, zero fwa ou plis

source: XY as a single group
mfe: XY kouma enn sel group

source: You can have entries with the target column missing, i.e. just containing the source term and the comment.
mfe: Ou kapav fer bann lantre avek kolonn sib vid, setadir ki ena zis term sours ek komanter.

source: You define its location and name in the project properties dialog.
mfe: Ou kapav definir file-la so lanplasman ek so nom dan bwat dialog propriete proze-la.

source: a through z or A through Z, inclusive (range)
mfe: a ziska z ou A ziska Z, avek (range)

source: a, b, or c (simple class)
mfe: a, b, ou c (klas sinp)

source: comma or a period, followed by spaces and yet another comma or period
mfe: virigl ouswa pwin, swivi par lespas ek enn lot virgil ouswa pwin

source: double words
mfe: mo doub

source: extra spaces after the period at the end of the line
mfe: lespas siplemanter apre pwin lafin lalign

source: greedy quantifiers will match as much as they can.
mfe: kantifikater gourman pou match otan korespondans ki zot kapav.

source: more than one space
mfe: plis ki enne lespas

source: multiple words entries in glossaries - example
mfe: Antre plizier mo dan gloser – exanp

source: non-greedy quantifiers will match as little as they can.
mfe: kantificater pares pou match otan tigit korespondans ki zot kapav.
